app/views/articles/show.html.erb

              <%= link_to gravatar_for(@article.user), user_path(@article.user), class: "d-inline-block" %>
              <% if @article.categories.any? %>
---
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = 12
SELECT 1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = 12 LIMIT 1