app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ('an article to delete', 'this article will be automatically deleted ', '2025-01-19 11:01:30.589307', '2025-01-19 11:01:30.589307', 8) RETURNING "id"

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "title" = 'second title', "description" = 'This is the definition', "updated_at" = '2025-01-16 17:30:36.004109' WHERE "articles"."id" = 4