app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 3)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 1 LIMIT 1
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = 2 LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = 2
---
  def show
    @category = Category.find(params[:id])  # Kategori id'si ile kategori bul
    @articles = @category.articles.paginate(page: params[:page], per_page: 5)