app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"

  def show
    @user = User.find(params[:id])
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = 1
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = 1

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "email", "password_digest", "admin") VALUES ('normal-user', '2025-01-21 08:11:13.777529', '2025-01-21 08:11:13.777529', 'nuser@example.com', '$2a$12$NvEYePQQFhmApXkQB7YMF.RzB8BQ2zerVrOT0.GvUBBotVwJTzH8W', 0) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "username" = 'user1-1', "updated_at" = '2025-01-18 08:40:34.511568', "password_digest" = '$2a$12$tG4Wz.CUn2Z7jkhOTiBs9eKCtjJmBi2ZmdTBB3Y6roadpYiyNecRC' WHERE "users"."id" = 1

    def set_user
      @user = User.find(params.expect(:id))
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1